[
  {
    "section": {
      "id": "0193bc88-b65d-7275-bee9-b327f6ad5be9",
      "name": "Разработка ПО",
      "books": [
        {
          "id": "0193bc88-b8bf-763a-93f0-054b04dc46ec",
          "description": "Translator\nАлгоритмы – это пошаговые инструкции решения задач, большинство из которых уже были кем-то решены, протестированы и доказали свою эффективность. Второе издание \"Грокаем алгоритмы\" упрощает изучение, понимание и использование алгоритмов.\nВ этой книге вы найдете простые и внятные объяснения, более 400 забавных иллюстраций и десятки примеров. Ее чтение – лучший способ раскрыть всю мощь алгоритмов и подготовиться к интервью по программированию. Глубоких знаний математики не требуется!\nВы узнаете о главных алгоритмах, позволяющих ускорить работу программ, упростить код и решить распространенные проблемы программирования. Начните с сортировки и поиска, а затем развивайте свои навыки для решения сложных задач, таких как сжатие данных и искусственный интеллект. Научитесь сравнивать эффективность различных алгоритмов.\nВо втором издании даны новые более подробные описания деревьев, NP-полные задачи, а код примеров обновлен на Python 3.\n\n",
          "imagePath": "/480/430/360/101/101360430_0_Rrokaem_algoritmi_Aditya_Bhargava.jpg",
          "price": 33.55,
          "name": "Грокаем алгоритмы",
          "author": "Адитья Бхаргава",
          "discountPrice": 33.21
        },
        {
          "id": "0193bc88-bade-7a9a-b0a8-56cc9fe8407c",
          "description": "Плохой код может работать, но он будет мешать развитию проекта и компании-разработчика, требуя дополнительные ресурсы на поддержку и \"укрощение\".\nКаким же должен быть код? Эта книга полна реальных примеров, позволяющих взглянуть на код с различных направлений: сверху вниз, снизу вверх и даже изнутри. Вы узнаете много нового о коде. Более того, научитесь отличать хороший код от плохого, узнаете, как писать хороший код и как преобразовать плохой код в хороший.\nКнига состоит из трёх частей. Сначала вы познакомитесь с принципами, паттернами и приёмами написания чистого кода. Затем приступите к практическим сценариям с нарастающей сложностью – упражнениям по чистке кода или преобразованию проблемного кода в менее проблемный. И только после этого перейдёте к самому важному – концентрированному выражению сути этой книги – набору эвристических правил и \"запахов кода\". Именно эта база знаний описывает путь мышления в процессе чтения, написания и чистки кода.\n",
          "imagePath": "/480/592/109/10/10109592_0_CHistiy_kod_Sozdanie_analiz_i_refaktoring_Robert_Martin.jpg",
          "price": 30.61,
          "name": "Чистый код. Создание, анализ и рефакторинг",
          "author": "Роберт Мартин",
          "discountPrice": null
        },
        {
          "id": "0193bc88-bd11-77d4-855f-5f292e50a57e",
          "description": "\"Идеальный программист\" и \"Чистый код\" – легендарные бестселлеры Роберта Мартина – рассказывают, как достичь высот профессионализма. \"Чистая архитектура\" продолжает эту тему, но не предлагает несколько вариантов в стиле \"решай сам\", а объясняет, что именно следует делать, по какой причине и почему именно такое решение станет принципиально важным для вашего успеха. Роберт Мартин даёт прямые и лаконичные ответы на ключевые вопросы архитектуры и дизайна.\n\"Чистую архитектуру\" обязаны прочитать разработчики всех уровней, системные аналитики, архитекторы и каждый программист, который желает подняться по карьерной лестнице или хотя бы повлиять на людей, которые занимаются данной работой.\n",
          "imagePath": "/480/440/682/10/10682440_0_CHistaya_arhitektura_Iskusstvo_razrabotki_programmnogo_obespecheniya_Robert_Martin.jpg",
          "price": 35.33,
          "name": "Чистая архитектура. Искусство разработки программного обеспечения",
          "author": "Роберт Мартин",
          "discountPrice": 24.73
        },
        {
          "id": "0193bc88-bf15-75af-96cb-6ddd0c80ef55",
          "description": "Больше 25 лет прошло с момента выхода первого тиража книги Design Patterns. За это время книга из популярной превратилась в культовую. Во всем мире ее рекомендуют прочитать каждому, кто хочет связать жизнь с информационными технологиями и программированием. \"Русский\" язык, на котором разговаривают айтишники поменялся, многие англоязычные термины стали привычными, паттерны вошли в нашу жизнь. Перед вами юбилейное издание с обновленным переводом книги, ставшей must-read для каждого программиста. \"Паттерны объектно-ориентированного проектирования\" пришли на смену \"Приемам объектно-ориентированного проектирования\".\nЧетыре первоклассных разработчика – Банда четырех – представляют вашему вниманию опыт ООП в виде двадцати трех паттернов. Паттерны появились потому, что разработчики искали пути повышения гибкости и степени повторного использования своих программ. Авторы не только дают принципы использования шаблонов проектирования, но и систематизируют информацию. Вы узнаете о роли паттернов в архитектуре сложных систем и сможете быстро и эффективно создавать собственные приложения с учетом всех ограничений, возникающих при разработке больших проектов. Все шаблоны взяты из реальных систем и основаны на реальной практике. Для каждого паттерна приведен код на C ++ или Smalltalk, демонстрирующий его возможности.\n",
          "imagePath": "/480/529/936/10/10936529_0_Patterni_obektno-orientirovannogo_proektirovaniya_Erik_Ramma_R_Helm_R_Dzhonson_Dzhon_Vlissides.jpg",
          "price": 33.55,
          "name": "Паттерны объектно-ориентированного проектирования",
          "author": "Неизвестен",
          "discountPrice": null
        },
        {
          "id": "0193bc88-c131-7a0c-97be-687375ff6a51",
          "description": "Грязный код создает проблемы. Чтобы код было проще читать, проходится проводить его очистку, разбивая на части, с которыми удобно работать. Кент Бек, создатель методологии экстремального программирования и первопроходец в области паттернов проектирования, рассказывает нам, где и когда лучше проводить очистку для улучшения кода с учетом общей структуры системы.\nКнига не заставляет читателя проводить очистку сразу и целиком, а позволяет протестировать несколько примеров, которые подходят для поставленной задачи. Вы узнаете, как логически разделить на части большую функцию, содержащую множество строк кода. Познакомитесь с теоретическими понятиями программного дизайна: сцеплением, связностью, дисконтированными денежными потоками и вариативностью.\n",
          "imagePath": "/480/139/325/101/101325139_0_CHistiy_dizayn_Kent_Bek.jpg",
          "price": 39.54,
          "name": "Чистый дизайн",
          "author": "Кент Бек",
          "discountPrice": null
        },
        {
          "id": "0193bc88-c435-7e4b-99a9-9278ad5bf08c",
          "description": "Эта книга – подробное руководство по разработке качественных требований к программному обеспечению. Здесь описаны десятки проверенных на практике приемов выявления, формулирования, разработки, проверки, утверждения и тестирования требований, которые помогут разработчикам, менеджерам и маркетологам создать эффективное ПО. Настоящее издание дополнено новыми приемами, посвященными разработке требований в проектах гибкой разработки (agile).\nОсновная аудитория – бизнес-аналитики и разработчики, а также дизайнеры, программисты, тестировщики и другие члены команды, задача которых понять и удовлетворить чаяния клиентов, а также маркетологи, менеджеры по продуктам и менеджеры проекта, которые должны проникнуться \"духом\" и особенностями продукта, чтобы сделать его в полной мере конкурентоспособным.\nКнига состоит из 32 глав, 3 приложений и словаря терминов.\n",
          "imagePath": "/480/201/10/1/1010201_0_Razrabotka_trebovaniy_k_programmnomu_obespecheniyu_Dzhoy_Bitti.jpg",
          "price": 54.52,
          "name": "Разработка требований к программному обеспечению",
          "author": "Джой Битти",
          "discountPrice": null
        },
        {
          "id": "0193bc88-c60a-74a8-b911-3b492a212dcb",
          "description": "Хватит тратить время на скучные академические фолианты! Изучение Computer Science может быть веселым и увлекательным занятием.\nВладстон Феррейра Фило знакомит нас с вычислительным мышлением, позволяющим решать любые сложные задачи. Научиться писать код просто – пара недель на курсах, и вы \"программист\", но чтобы стать профи, который будет востребован всегда и везде, нужны фундаментальные знания. Здесь вы найдете только самую важную информацию, которая необходима каждому разработчику и программисту каждый день.\n",
          "imagePath": "/480/359/698/10/10698359_0_Teoreticheskiy_minimum_po_Computer_Science_Vse_chto_nuzhno_programmistu_i_razrabotchiku_Vladston_Ferreyra_Filo.jpg",
          "price": 28.83,
          "name": "Теоретический минимум по Computer Science. Все что нужно программисту и разработчику",
          "author": "Владстон Феррейра Фило",
          "discountPrice": 21.05
        },
        {
          "id": "0193bc88-c858-76da-b1f2-031b28c2ac21",
          "description": "Пользовательские истории – это метод описания требований к разрабатываемому продукту. Автор доступно и интересно рассказывает, как правильно использовать данную технику, чтобы сфокусироваться на поставленной задаче и пожеланиях клиента, а не распыляться на реализации второстепенных функций. Описанный подход не только ускоряет и систематизирует разработку, но и улучшает взаимопонимание в команде.\nВ этой книге вы найдете:\nПрактические советы по сбору пользовательских историй.\nСуть пользовательских историй, секреты ихприменения в гибкой разработке.\nСоветы о том, как организовать жизненный цикл разработки ПО. \n\n",
          "imagePath": "/480/740/370/101/101370740_0_Polzovatelskie_istorii_Iskusstvo_gibkoy_razrabotki_PO_Dzheff_Patton.jpg",
          "price": 40.66,
          "name": "Пользовательские истории. Искусство гибкой разработки ПО",
          "author": "Джефф Паттон",
          "discountPrice": 39.03
        },
        {
          "id": "0193bc88-ca58-724f-9f32-38149598a8d4",
          "description": "Уникальная книга-тренинг по тестированию программ, охватывающая весь необходимый тестировщику спектр знаний с азов до сложных концепций. Рассматриваются виды и методики тестирования, способы поиска ошибок в программах, оформления тест-кейсов и чек-листов, описания выявленных недостатков и предлагаемых улучшений. Книга содержит домашние задания, выполнив которые читатель освоит тестирование ПО на практике и соберёт портфолио, необходимое для последующего трудоустройства.\nДля начинающих тестировщиков ПО.\n",
          "imagePath": "/480/804/267/101/101267804_0_CHto_takoe_testirovanie_Kurs_molodogo_boyca_Olga_Nazina.jpg",
          "price": 52.47,
          "name": "Что такое тестирование. Курс молодого бойца",
          "author": "Ольга Назина",
          "discountPrice": null
        },
        {
          "id": "0193bc88-cc3b-7a32-8933-5e534895c437",
          "description": "Играть в игры и получать за это деньги? Звучит как работа мечты! Но чем на самом деле занимаются тестировщики?\nТестирование – критически важный этап при создании видеоигр, позволяющий разработчикам исправить ошибки и недочеты, а игрокам – сполна насладиться геймплеем.\nНа страницах книги ты найдешь ответы на самые важные вопросы о профессии QA-специалиста в области игровой разработки, множество практических советов, рекомендаций, а также разборы реальных кейсов из жизни компаний.\n\nПочему игры необходимо тестировать и чем они отличаются от другого ПО?\nЧем занимается тестировщик игр и что нужно знать, чтобы им стать?\nКакие бывают баги, почему они случаются и как с ними работать?\nЧем отличается тестирование игр для разных игровых платформ?\nКак начать карьеру в области тестирования и куда развиваться?\n\n\nПосле прочтения книги ты станешь лучше понимать процесс продуктовой разработки, узнаешь все о работе тестировщика и сможешь внести свой вклад в создание видеоигры.\n",
          "imagePath": "/480/658/350/101/101350658_0_Testirovanie_videoigr_ili_Legkiy_sposob_popast_v_geymdev_Aleksandr_Torgovkin.jpg",
          "price": 52.64,
          "name": "Тестирование видеоигр, или Легкий способ попасть в геймдев",
          "author": "Александр Торговкин",
          "discountPrice": 48.43
        },
        {
          "id": "0193bc88-ce3f-71a0-be57-e1043433f554",
          "description": "Более 10 лет первое издание этой книги считалось одним из лучших практических руководств по программированию. Сейчас эта книга полностью обновлена с учетом современных тенденций и технологий и дополнена сотнями новых примеров, иллюстрирующих искусство и науку программирования. Опираясь на академические исследования, с одной стороны, и практический опыт коммерческих разработок ПО – с другой, автор синтезировал из самых эффективных методик и наиболее эффективных принципов ясное прагматичное руководство. Каков бы ни был ваш профессиональный уровень, с какими бы средствами разработками вы ни работали, какова бы ни была сложность вашего проекта, в этой книге вы найдете нужную информацию, она заставит вас размышлять и поможет создать совершенный код.\nКнига состоит из 35 глав, предметного указателя и библиографии.\n",
          "imagePath": "/480/206/15/1/1015206_0_Sovershenniy_kod_Master-klass_Stiv_MakKonnell.jpg",
          "price": 89.28,
          "name": "Совершенный код. Мастер-класс",
          "author": "Стив МакКоннелл",
          "discountPrice": null
        },
        {
          "id": "0193bc88-d070-7433-a884-fa1735681743",
          "description": "Эта книга – не академический учебник по программированию, а скорее сборник универсальных \"рецептов\" использования широкого класса алгоритмов в самых распространенных случаях, требующих применения четкой последовательности инструкций для создания изящного и максимально оптимизированного рабочего кода. Если вы стремитесь понять сущность алгоритмов и в совершенстве овладеть ими для решения разнообразных задач при разработке программного обеспечения, это издание станет вашим незаменимым помощником.\nКаждый раздел книги базируется на топовых материалах сайта Stack Overflow на тему алгоритмов и представляет собой краткое описание алгоритма с примерами, реализованными на разных языках программирования или в псевдокоде. В числе прочих рассмотрены алгоритмы работы с графами, алгоритмы быстрого поиска и сортировки, алгоритмы обработки строковых переменных и многое другое.\n",
          "imagePath": "/480/922/310/101/101310922_0_Algoritmi_v_zadachah_i_primerah.jpg",
          "price": 26.37,
          "name": "Алгоритмы в задачах и примерах",
          "author": "Неизвестен",
          "discountPrice": null
        },
        {
          "id": "0193bc88-d2b3-7d87-8530-244d8230df35",
          "description": "Книга \"Карьера программиста\" основана на опыте практического участия автора во множестве собеседований, проводимых лучшими компаниями. Это квинтэссенция сотен интервью со множеством кандидатов, результат ответов на тысячи вопросов, задаваемых кандидатами и интервьюерами в ведущих мировых корпорациях. Из тысяч возможных задач и вопросов в книгу были отобраны 189 наиболее интересных и значимых.\nШестое издание этого мирового бестселлера поможет вам наилучшим образом подготовиться к собеседованию при приеме на работу программистом или руководителем в крупную IT-организацию или перспективный стартап. Основную часть книги составляют ответы на технические вопросы и задания, которые обычно получают соискатели на собеседовании в таких компаниях, как Google, Microsoft, Apple, Amazon и других. Рассмотрены типичные ошибки, которые допускают кандидаты, а также эффективные методики поготовки к собеседованию. Используя материал этой книги, вы с легкостью подготовитесь к устройству на работу в Google, Microsoft или любую другую ведущую IT-компанию.\n",
          "imagePath": "/480/698/944/10/10944698_0_Karera_programmista_Reyl_Lakman_Makdauell_Reyl_Lakman_Makdauell.jpg",
          "price": 66.61,
          "name": "Карьера программиста",
          "author": "Гейл Лакман Макдауэлл",
          "discountPrice": null
        },
        {
          "id": "0193bc88-d4c8-71a2-ad5b-f972b8e3b82b",
          "description": "Все мы – безумцы, живущие в технологическом сумасшедшем доме, и создали этот безумный мир мы сами. Своими руками сотворили этот кошмар: интерфейсы, которые нас раздражают и утомляют глаза, устройства, которые приводят к болям в спине и в запястьях. Эта книга стала манифестом и до сих пор не потеряла актуальность. Дверь на свободу распахнута. Почему же мы не замечаем выхода?\nОб этом и рассказывает Алан Купер, объясняя разницу между интерфейсом и взаимодействием. Эй, ребята, у вас тут полно обозленных клиентов. Вам есть что им ответить?\n",
          "imagePath": "/480/612/689/10/10689612_0_Psihbolnica_v_rukah_pacientov_Alan_Kuper.jpg",
          "price": 47.85,
          "name": "Психбольница в руках пациентов",
          "author": "Алан Купер",
          "discountPrice": null
        },
        {
          "id": "0193bc88-d7a7-71f4-a3d3-c4a2af18a697",
          "description": "Данное издание может стать незаменимым помощником для любого пользователя системы контроля версий Git, в наши дни широко распространенной в сфере разработки программного обеспечения благодаря своей \"продвинутости\" и универсальности. Авторы разделов этой книги – опытные разработчики, постоянно и активно использующие Git в решении повседневных задач при написании и систематизации программного кода. В частности, здесь рассмотрены восстановление предыдущих состояний системы в случае неудачных действий с Git, возможность отправки в удаленный репозиторий выборочных коммитов, особенности быстрого переключения с одной задачи на другую без потери прогресса в работе, использование рабочих деревьев, восстановление удаленного репозитория и многое другое.\n",
          "imagePath": "/480/372/330/101/101330372_0_Sekreti_IT_Nikogda_ne_teryay_svoy_kod.jpg",
          "price": 19.76,
          "name": "Секреты GIT. Никогда не теряй свой код!",
          "author": "Неизвестен",
          "discountPrice": null
        },
        {
          "id": "0193bc88-d9ba-75aa-88f8-65c88b5c8f19",
          "description": "По мере того как организации переходят от монолитных приложений к небольшим автономным микросервисам, распределенные системы становятся все более детализированными. Второе дополненное издание предлагает целостный взгляд на самые актуальные темы, в которых необходимо разбираться при создании и масштабировании архитектуры микросервисов, а также управлении ею. Вы познакомитесь с современными решениями для моделирования, интеграции, тестирования, развертывания и мониторинга собственных автономных сервисов. Примеры из реальной жизни показывают, как получить максимальную отдачу от этих архитектур.\n",
          "imagePath": "/480/929/210/101/101210929_0_Sozdanie_mikroservisov_Sem_Nyumen.jpg",
          "price": 95.52,
          "name": "Создание микросервисов",
          "author": "Сэм Ньюмен",
          "discountPrice": null
        },
        {
          "id": "0193bc88-dba6-75ee-804b-f2b5ac5a25af",
          "description": "В книге приводится всесторонний анализ идей и деталей реализации структур данных как важнейшей составляющей прикладных алгоритмов. Рассматриваются не только эффективные способы реализации операций над множествами чисел, интервалов или строк в виде различных поисковых структур данных – деревьев, множеств интервалов, кусочно-постоянных функций, прямоугольных областей, непересекающихся подмножеств, куч, хеш-таблиц, но и динамизация и персистентность (сохраняемость) структур.\nЭто первая книга, рассматривающая структуры данных не просто как вспомогательный материал для иллюстрации методологии объектно-ориентированного программирования, а как ключевой вопрос разработки алгоритмов.\nМногочисленные примеры кода на языке C и более 500 ссылок на первоисточники делают эту книгу исключительно ценной.\n",
          "imagePath": "/480/0/191/101/101191000_0_Usovershenstvovannie_strukturi_dannih_Peter_Brass.jpg",
          "price": 101.21,
          "name": "Усовершенствованные структуры данных",
          "author": "Петер Брасс",
          "discountPrice": null
        },
        {
          "id": "0193bc88-ddbd-7af4-b3cc-85b94b47e928",
          "description": "Перед вами бестселлер, стоящий наравне с такими гигантами, как Структура и интерпретация компьютерных программ (Structure and Interpretation of Computer Programs) и Как проектировать программы (How to Design Program). Авторы последовательно и методично подводят читателей к таким сложным темам, как рекурсия (и, решая предложенные в книге задачи, вы научитесь мыслить рекурсивно), Y-комбинатор, продолжения (continuations) и проблема остановки.\nКнига для тех, кто стремится не только уметь понимать код, но и мыслить в нем и перестраивать его, выходя за рамки обыденного программирования и погружаясь в более абстрактный мир вычислений.\nБлагодаря увлекательному формату \"вопрос-ответ\" читатель знакомится с различными способами обдумывания проблем и получает возможность понять основы функционального программирования благодаря усвоению базовых теоретических концепций.\n",
          "imagePath": "/480/944/315/101/101315944_0_The_Little_Schemer_CHudesnoe_funkcionalnoe_programmirovanie_Deniel_Fridman_Matias_Felleyzen.jpg",
          "price": 62.63,
          "name": "The Little Schemer. Чудесное функциональное программирование",
          "author": "Матиас Феллейзен",
          "discountPrice": null
        },
        {
          "id": "0193bc88-df81-7ea9-9e95-171660406927",
          "description": "\"Как пасти котов\" – это книга о лидерстве и руководстве, о том, как первое совмещать со вторым. Это, если хотите, словарь трудных случаев управления IT-проектами. Программист подобен кошке, которая гуляет сама по себе. Так уж исторически сложилось. Именно поэтому так непросто быть руководителем команды программистов. Даже если вы еще месяц назад были блестящим и дисциплинированным программистом и вдруг оказались в роли менеджера, вряд ли вы знаете, с чего надо начать, какой выбрать стиль руководства, как нанимать и увольнять сотрудников, проводить совещания, добиваться своевременного выполнения задач. В таком случае без этой книги вам не обойтись. А может быть, вы – опытный менеджер, желающий пересмотреть свои принципы лидерства? Тогда, опять же, эта книга для вас. Вне зависимости от возраста, пола и социального статуса, она поможет вам укрепить свои позиции в роли лидера программистов. Материал изложен довольно компактно и легко укладывается в голове. Стоя в книжном магазине и раздумывая, что же купить, задайте себе один простой вопрос: \"Нужно ли мне совершенствовать свои лидерские навыки?\" Полагаю, вы ответите: \"Да\", – а значит, данная книга окажется для вас небесполезной.\n",
          "imagePath": "/480/852/16/1/1016852_0_Kak_pasti_kotov_Nastavlenie_dlya_programmistov_rukovodyaschih_drugimi_programmistami_Dzh_Reynvoter.jpg",
          "price": 33.72,
          "name": "Как пасти котов. Наставление для программистов, руководящих другими программистами",
          "author": "Дж. Рейнвотер",
          "discountPrice": 32.71
        },
        {
          "id": "0193bc88-e181-75bc-8430-1d39f713daef",
          "description": "Классическая книга Э. Эванса освещает наиболее общий, стратегический круг вопросов, связанных с объектно-ориентированной разработкой программного обеспечения. Это переработка и структуризация знаний о предметных областях, применение типовых архитектурных шаблонов, построение и анализ моделей предметных областей, проектирование программных объектов с точки зрения качества их взаимодействия и передачи логической структуры знаний, организация программ на основе крупномасштабных структур, выработка общего языка и стратегии коммуникации в группе. Подход автора строится на динамичном рефакторинге модели и постоянной дистилляции знаний. Это позволяет достигнуть высокой степени гармонии между логикой предметной области и кодом программы, а также достаточной гибкости программной архитектуры для целей удобной доработки и интеграции программного обеспечения. Книга насыщена практическими примерами из реальных проектов.\nМировое сообщество программистов признает, что моделирование предметных областей – ключевой раздел проектирования программного обеспечения. В моделях предметных областей разработчики выражают сложные функции своих программ, реализуя их затем в таком виде, который отвечает реальным потребностям пользователей. Но несмотря на очевидную важность предмета, существует очень мало пособий по эффективному внедрению моделирования предметных областей в практику разработки программ.\nКнига Эрика Эванса заполняет этот пробел.\nОна посвящена не отдельным технологиям, а систематическому предметно-ориентированному подходу. В ней представлен широкий набор приемов и методик, основанных на практическом опыте, и фундаментальных принципов, помогающих в реализации программных проектов из сложных предметных областей. Органично переплетая практику проектирования и реализации программ, эта книга содержит множество фактических примеров, иллюстрирующих применение общих стратегических принципов в реальных программных проектах.\nИз книги читатель узнает, как с помощью модели предметной области придать разработке сложной системы нужную направленность и динамику. Выделены основные приемы и образцы-шаблоны, образующие общий язык группы разработчиков. Особо подчеркивается необходимость рефакторинга не только кода, но и модели в его основе, что в сочетании с итерационной agile-методикой приводит к углублению знаний о предметной области и повышению качества взаимодействия между специалистами и программистами. Подход книги строится именно на этом фундаменте, предлагая модели и архитектуры для систем и организаций любой сложности.\nВ частности, в книге рассматриваются следующие темы:\nЕдиный язык общения для всей группы разработчиков.\nГлубокая связь между моделью и программной реализацией.\nВыделение ключевых черт модели.\nУправление циклом существования объектов.\nНаписание легко интегрируемого кода предметной области.\nКак сделать сложный код очевидным и предсказуемым в поведении.\nФормулировка введения в предметную область.\nДистилляция ядра предметной области.\nПоиск неявных понятий, скрытых в модели.\nПрименение аналитических шаблонов.\nАрхитектурные шаблоны в моделях.\nПоддержание целостности больших систем.\nСосуществование нескольких моделей в одном проекте.\nОрганизация систем в соответствии с крупномасштабными структурами.\nКачественные скачки в моделях.\n\nИмея под рукой эту книгу, разработчики объектно-ориентированных программ, системные аналитики и архитекторы будут всегда располагать набором рекомендаций по организации своего труда, созданию сложных и полезных моделей предметных областей, превращению их в высококачественные, долгоживущие программные продукты.\nКнига предназначена для повышения квалификации программистов, работающих, в частности, по методикам экстремального программирования и agile-разработки. Может быть полезна студентам соответствующих специальностей.\n",
          "imagePath": "/480/181/88/101/101088181_0_Predmetno-orientirovannoe_proektirovanie_Strukturizaciya_slozhnih_programmnih_sistem_Erik_Evans.jpg",
          "price": 246.04,
          "name": "Предметно-ориентированное проектирование. Структуризация сложных программных систем",
          "author": "Эрик Эванс",
          "discountPrice": 214.05
        },
        {
          "id": "0193bc88-e3a2-739c-b565-0d9830e758f5",
          "description": "Не имеет смысла каждый раз изобретать велосипед, лучше сразу освоить приемы проектирования, которые уже созданы людьми, сталкивавшимися с аналогичными задачами. В этой книге рассказано, какие паттерны действительно важны, когда и при каких условиях ими необходимо пользоваться, как применить их в ваших проектах и на каких принципах объектно-ориентированного проектирования они построены. Присоединяйтесь к сотням тысяч разработчиков, которые повысили свою квалификацию объектно-ориентированного проектирования благодаря книге \"Head First. Паттерны проектирования\".\nЕсли вы уже читали книги из серии Head First, то знаете, что вас ждет визуально насыщенный формат, разработанный с учетом особенностей работы мозга. В книге \"Head First. Паттерны проектирования\" принципы и паттерны проектирования представлены так, чтобы вы не заснули, читая книгу, научились решать реальные задачи проектирования программных продуктов и общаться на языке паттернов с другими участниками вашей команды.\n",
          "imagePath": "/480/224/43/101/101043224_0_Head_First_Patterni_proektirovaniya.jpg",
          "price": 79.53,
          "name": "Head First. Паттерны проектирования",
          "author": "Неизвестен",
          "discountPrice": 66.01
        },
        {
          "id": "0193bc88-e5ec-75c9-9733-1352c4762b1b",
          "description": "Kubernetes по-­гречески означает “рулевой”. Это ваш проводник по неизведанным водам. Система контейнерной оркестровки Kubernetes безопасно управляет структурой распределенного приложения и последовательностью его выполнения, с максимальной эффективностью организуя контейнеры и службы. Kubernetes служит в качестве операционной системы для ваших кластеров, устраняя необходимость учитывать лежащую в основе сетевую и серверную инфраструктуру в ваших проектах.\nЭта книга учит использовать Kubernetes для развертывания распределенных контейнеризированных приложений. Перед тем, как собрать свой первый кластер Kubernetes, вы начнете с обзора систем Docker и Kubernetes. Вы будете постепенно расширять свое начальное приложение, добавляя новые функциональные возможности и углубляя свои знания архитектуры и принципа работы Kubernetes. Также вы изучите такие важные темы, как мониторинг, настройка и масштабирование.\n",
          "imagePath": "/480/447/894/10/10894447_0_Kubernetes_v_deystvii_Marko_Luksha.jpg",
          "price": 81.92,
          "name": "Kubernetes в действии",
          "author": "Марко Лукша",
          "discountPrice": 77
        },
        {
          "id": "0193bc88-e83c-7467-af47-59ea8953ddc5",
          "description": "Если вам нужно разобраться в том, что из себя представляют алгоритмы и графы, как они работают и какими бывают, эта книга для вас. Ее автор, Панос Луридас, уже много лет использует алгоритмы при проектировании программного обеспечения, криптографии, машинном обучении, и является научным сотрудником Афинского университета экономики и бизнеса. Очень доступным даже для новичков языком он знакомит читателей с концепцией алгоритмов и принципами их работы – для чтения книги достаточно базового школьного образования.\n",
          "imagePath": "/480/169/111/101/101111169_0_Algoritmi_Samiy_kratkiy_i_ponyatniy_kurs_Panos_Luridas.jpg",
          "price": 23.51,
          "name": "Алгоритмы. Самый краткий и понятный курс",
          "author": "Панос Луридас",
          "discountPrice": null
        },
        {
          "id": "0193bc88-eb28-7e2c-a21e-f21ee98aeb0e",
          "description": "Сказка о великой битве, в которой молодой мангуст в одиночку сражался с двумя огромными кобрами, вот уже свыше ста лет восхищает читателей по всему миру. В этом издании она предстаёт в новом переводе и с новыми современными иллюстрациями.\nИздательство постаралось передать свой взгляд на эту историю, сохранив при этом узнаваемый стиль любимого писателя.\n",
          "imagePath": "/480/715/320/101/101320715_0_Rrokaem_Continuous_Delivery_K_Uilson.jpg",
          "price": 55.54,
          "name": "Грокаем Continuous Delivery",
          "author": "К. Уилсон",
          "discountPrice": null
        },
        {
          "id": "0193bc88-ecf1-7918-afa2-e3beb3f7cf20",
          "description": "Рассматриваются базовая терминология и понятия в сфере тестирования ПО. Описываются ручное исследовательское тестирование, тестирование API, тестирование баз данных, кроссбраузерное тестирование, тестирование мобильных приложений, разработка стратегий тестирования, тестирование безопасности, производительности, юзабилити и доступности, показаны основы автоматизации тестирования. Уделено внимание созданию тест-планов, использованию системы управления версиями и работе с инструментарием Git.. Рассказано о принципах эффективной работы в команде. В книгу включены практические задания, призванные закрепить полученные знания.\n",
          "imagePath": "/480/751/317/101/101317751_0_Idealniy_testirovschik_Kristin_Dzhekvoni.jpg",
          "price": 44.06,
          "name": "Идеальный тестировщик",
          "author": "Кристин Джеквони",
          "discountPrice": 38.77
        },
        {
          "id": "0193bc88-eedd-76bc-8e30-edd745a60bbe",
          "description": "Эта книга представляет собой обновленное руководство по использованию Git в современных условиях. С тех пор как проект Git – распределенная система управления версиями – был создан Линусом Торвальдсом, прошло много лет, и система Git превратилась в доминирующую систему контроля версий, как для коммерческих целей, так и для проектов с открытым исходным кодом. Эффективный и хорошо реализованный контроль версий необходим для любого успешного веб-проекта. Постепенно эту систему приняли на вооружение практически все сообщества разработчиков ПО с открытым исходным кодом. Появление огромного числа графических интерфейсов для всех платформ и поддержка IDE позволили внедрить Git в операционные системы семейства Windows. Второе издание книги было обновлено для Git-версии 2.0 и уделяет большое внимание GitHub.\n",
          "imagePath": "/480/238/453/10/10453238_0_it_dlya_professionalnogo_programmista_S_CHakon_B_Shtraub.jpg",
          "price": 53.99,
          "name": "Git для профессионального программиста",
          "author": "С. Чакон",
          "discountPrice": null
        },
        {
          "id": "0193bc88-f0e4-7557-a16e-7f859b75a76d",
          "description": "Впервые введение в геймдизайн, прототипирование и геймдев объединены в одну книгу. Если вы собираетесь заняться разработкой игр, то в первую очередь вам необходима информация о современных методах и профессиональных инструментах. Эти незаменимые знания можно получить в книге Джереми Гибсона Бонда. Кросс-платформенная разработка Unity позволяет создать игру, а затем с легкостью портировать куда угодно – от Windows и Linux до популярных мобильных платформ.\nНачните путешествие в мир игровой индустрии прямо сейчас! Заявите гордо: \"Я – геймдизайнер\". Ведь, если вас услышат другие, то вы будете стараться соответствовать своим словам. А что дальше? Как стать геймдизайнером? Ответы на эти вопросы дает книга Джереми Гибсона Бонда – геймдизайнера и профессора, который больше 10 лет учит других создавать великолепные игры и делает это сам.\nВы погрузитесь в увлекательный мир игровой индустрии, построите 8 реальных прототипов и овладеете всеми необходимыми инструментами.\n\"Книга сочетает в себе важные философские и практические понятия, необходимые всем, кто хочет стать настоящим разработчиком игр. Она познакомит вас с высокоуровневыми теориями проектирования, главными понятиями из мира разработки игр и основами программирования. ... Джереми использовал свой многолетний опыт, чтобы научить вас мыслить категориями геймдева и создавать игры\".\nМишель Пун (Michelle Pun), игровой продюсер в Osmo. Ведущий геймдизайнер в Disney и Zynga.\n",
          "imagePath": "/480/169/812/10/10812169_0_Unity_i_C_Reymdev_ot_idei_do_realizacii_Dzheremi_Ribson_Bond_Richard_Lemarchand.jpg",
          "price": 105.48,
          "name": "Unity и C#. Геймдев от идеи до реализации",
          "author": "Джереми Гибсон Бонд",
          "discountPrice": null
        },
        {
          "id": "0193bc88-f31b-7d1d-ad38-5399b294bc57",
          "description": "Узнайте, как придумать и создать свою первую игру. Загляните за кулисы гейм-дизайна и глубоко погрузитесь в теорию и техническую сторону разработки видеоигр.\nКнига затрагивает теорию гейм-дизайна, практические особенности реализации игр в различных жанрах, их внутренние механизмы и самые успешные проекты в конкурентном игровом мире. Майкл Киллик, получивший премию BAFTA за наставничество молодых дизайнеров видеоигр, познакомит вас с техническими аспектами разработки игр и поделится приемами, которые помогут сделать первые шаги на пути создания собственных проектов. Вы поймете особенности игровой индустрии и будете разбираться во всех этапах создания игрового продукта, от идеи до разработки и выпуска игры.\n",
          "imagePath": "/480/595/307/101/101307595_0_Reym-dizayn_Maykl_Killik.jpg",
          "price": 44.39,
          "name": "Гейм-дизайн",
          "author": "Майкл Киллик",
          "discountPrice": 43.95
        },
        {
          "id": "0193bc88-f558-77ef-996c-d4d2f36343f4",
          "description": "Перед вами – первая книга о глубоком обучении, написанная на русском языке. Глубокие модели оказались ключом, который подходит ко всем замкам сразу: новые архитектуры и алгоритмы обучения, а также увеличившиеся вычислительные мощности и появившиеся огромные наборы данных, привели к революционным прорывам в компьютерном зрении, распознавании речи, обработке естественного языка и многих других типично \"человеческих\" задачах машинного обучения.\nЭти захватывающие идеи, вся история и основные компоненты революции глубокого обучения, а также самые современные достижения этой области, доступно и интересно изложены в книге. Максимум объяснений, минимум кода, серьезный материал о машинном обучении и увлекательное изложение – в этой уникальной работе замечательных российских ученых и интеллектуалов.\n",
          "imagePath": "/480/570/663/10/10663570_0_Rlubokoe_obuchenie.jpg",
          "price": 59.99,
          "name": "Глубокое обучение",
          "author": "Екатерина Архангельская",
          "discountPrice": null
        },
        {
          "id": "0193bc88-f7df-7529-90c4-05eee44e7240",
          "description": "Мы учимся, взаимодействуя с окружающей средой, и получаемые вознаграждения и наказания определяют наше поведение в будущем. Глубокое обучение с подкреплением привносит этот естественный процесс в искусственный интеллект и предполагает анализ результатов для выявления наиболее эффективных путей движения вперед. Агенты глубокого обучения с подкреплением могут способствовать успеху маркетинговых кампаний, прогнозировать рост акций и побеждать гроссмейстеров в Го и шахматах.\nДавайте научимся создавать системы глубокого обучения на примере увлекательных упражнений, сопровождаемых кодом на Python с подробными комментариями и понятными объяснениями. Вы увидите, как работают алгоритмы, и научитесь создавать собственных агентов глубокого обучения с подкреплением, используя оценочную обратную связь.\n",
          "imagePath": "/480/224/245/101/101245224_0_Rrokaem_glubokoe_obuchenie_s_podkrepleniem_Migel_Morales.jpg",
          "price": 66.2,
          "name": "Грокаем глубокое обучение с подкреплением",
          "author": "Мигель Моралес",
          "discountPrice": null
        }
      ]
    }
  },
  {
    "section": {
      "id": "0193bc88-fa99-717e-ac07-15764cf33175",
      "name": "Творчество",
      "books": [
        {
          "id": "0193bc88-fe1a-7bfd-8d9e-2a05f108b542",
          "description": "Внутри ежедневника:\nблоки для планирования и записи дел;\nтрекеры привычек;\n365 цитат из книг Ольги Примаченко;\nфразы-послания на каждый день;\nрубрики по принципу \"подсказка от Вселенной\" (\"Глагол дня\", \"Ресурс недели\", \"Особый фокус внимания\"), \"Выборы в пользу себя\", \"Метафора дня\" и др. Плюс подробные алгоритмы и инструкции, как с этими инструментами можно работать для пользы и удовольствия.\n\nОтдельные страницы в ежедневнике отведены для настройки на каждую неделю и анализа ее итогов.\nА еще вас ожидают 52 бонусные страницы с интересными практиками (в том числе с метафорическими ассоциативными картами), памятками, упражнениями, списками литературы, чек-листами, иллюстрациями для раскрашивания, колесом баланса и множеством других классных штук для исследования себя, развлечения и вдохновения!\n",
          "imagePath": "/480/396/338/101/101338396_0_I_pust_god_budet_dobrim_365_dney_bez_sueti_rozoviy_Olga_Primachenko.jpg",
          "price": 20.95,
          "name": "И пусть год будет добрым. 365 дней без суеты (розовый)",
          "author": "Ольга Примаченко",
          "discountPrice": 19.27
        },
        {
          "id": "0193bc89-0019-736a-8280-44cd8d0d9a2e",
          "description": "В наборе 31 карточка на каждый день декабря. В каждой карточке по 3 задания, которые разделены по уровням сложности. В этом наборе ты можешь встретить совершенно разные задания, например, угостить друга кофе, или не спать до полуночи, или испечь рождественский кекс и, наконец, быть бесконечно счастливым! И ты самостоятельно решаешь, что выполнить сегодня.\nРазмер карточек: 65х89 мм.\nРазмер коробки: 90х68х20 мм.\n\n",
          "imagePath": "/480/611/367/101/101367611_0_Advent-kalendar_s_zadaniyami_Novogodniy_perepoloh_2.jpg",
          "price": 22.57,
          "name": "Адвент-календарь с заданиями \"Новогодний переполох 2\"",
          "author": "Неизвестен",
          "discountPrice": 22.57
        },
        {
          "id": "0193bc89-021b-75dd-a077-fd9f4e70dfe5",
          "description": "\"К себе нежно\" – это ежедневник от автора одноименного бестселлера, Он не про успешный успех и карьерную мотивацию – он про бережное отношение к себе, про то тихое и нежное, что у вас внутри.\nС помощью этого ежедневника вы не только сможете помнить о предстоящих делах и задачах, но и обретете верного друга, который будет от страницы к странице обнимать вас словами.\n",
          "imagePath": "/480/749/42/101/101042749_0_K_sebe_nezhno_Ezhednevnik_Olga_Primachenko.jpg",
          "price": 16.61,
          "name": "К себе нежно. Ежедневник",
          "author": "Ольга Примаченко",
          "discountPrice": null
        },
        {
          "id": "0193bc89-0434-7bde-a80b-380959ad8aab",
          "description": "Счастье не является результатом везения или случайного стечения обстоятельств. Стать счастливым помогают правильные установки и образ мыслей. 3 минуты утром и 3 минуты вечером – столько времени займет выработка полезных привычек, которые сделают вашу жизнь осознаннее, гармоничнее, а значит – счастливее. Проверенные на практике принципы позитивной психологии и нейробиологии помогут вам достичь целей, пережить трудные моменты, улучшить отношения с другими людьми и идти по жизни уверенно. С ежедневником вы сможете улучшать свою жизнь постоянно и проактивно, шаг за шагом и каждый день!\n",
          "imagePath": "/480/106/889/10/10889106_0_6_minut_Ezhednevnik_kotoriy_izmenit_vashu_zhizn_pudra_Dominik__Spenst.jpg",
          "price": 26.03,
          "name": "6 минут. Ежедневник, который изменит вашу жизнь (пудра)",
          "author": "Доминик Спенст",
          "discountPrice": null
        },
        {
          "id": "0193bc89-0640-7e2a-9d48-cd2114341d88",
          "description": "Это самая настоящая раскраска-антистресс! Если у вас был тяжелый день, вы устали на работе, вас раздражает все вокруг – просто возьмите цветные карандаши или фломастеры, выберите фразу, наиболее полно описывающую ваше состояние, и раскрасьте ее. Хорошее настроение гарантировано!\n",
          "imagePath": "/480/930/921/10/10921930_0_Kak_vse_zadolbalo_Raskraska-antistress_dlya_vzroslih.jpg",
          "price": 15.01,
          "name": "Как всё задолбало! Раскраска-антистресс для взрослых",
          "author": "Неизвестен",
          "discountPrice": null
        },
        {
          "id": "0193bc89-0819-7632-87d5-ee5a5204693d",
          "description": "Твой путеводитель позитивных мыслей на день.\nСоздай себе ежедневный утренний ритуал.\nДанный набор состоит из 31 карточки с фразами, которые помогут найти опору в себе, поднять настроение и зарядить энергией на целый день. Используй их как пожелаешь: вытягивай по одной карте каждый день на протяжении месяца или обращайся к ним только в те моменты, когда нужна поддержка. Носи карту с собой, оставь ее на своем рабочем месте, повесь на стену или используй как закладку для книги – она подойтет для любой цели.\nРазмер карточек: 59х89 мм.\nРазмер коробки: 60х90х15 мм.\n\n\n",
          "imagePath": "/480/477/373/101/101373477_0_Motivacionnie_kartochki_Karta_dnya.jpg",
          "price": 16.71,
          "name": "Мотивационные карточки \"Карта дня\"",
          "author": "Неизвестен",
          "discountPrice": null
        },
        {
          "id": "0193bc89-09fb-7b4b-837b-edb5f21863f9",
          "description": "В небольшой книжечке вы найдете цветные листы-заготовки с уже нанесенной разметкой контура для вырезания восьми ажурных снежинок. Вам нужно всего лишь открепить скрепку, разрезать листы по сгибу, сложить лист-заготовку по приведенной на обложке схеме и затем вырезать ножницами снежинку по линиям. Снежинками из бумаги можно украсить окно, зеркало, елку, открытку, использовать для сервировки праздничного стола или в качестве дополнения к упаковке новогоднего подарка.\n",
          "imagePath": "/480/176/60/101/101060176_0_Snezhinki_iz_bumagi_Novogodniy_feyerverk.jpg",
          "price": 3.04,
          "name": "Снежинки из бумаги \"Новогодний фейерверк\"",
          "author": "Неизвестен",
          "discountPrice": 2.43
        },
        {
          "id": "0193bc89-0c26-7f67-a3ee-1940d34f2fe4",
          "description": "Эта раскраска – уютный безопасный мир, полный света и нежности, который проступает на бумаге благодаря карандашам и краскам.\nВнутри вы найдете 22 теплых сюжета, нарисованных от руки художницей Еленой Крыминой. В них можно спрятаться от невзгод, занырнуть с головой, словно в чистую прозрачную воду, и почувствовать, как проясняется ум и успокаивается сердце.\nРаботая с раскраской, прислушивайтесь к себе: какие цвета хочется выбрать? какой атмосферой наполнить каждую иллюстрацию? какое настроение создать? – и ни в чем себе не отказывайте.\nКаждая из картинок сопровождается краткими медитативными текстами Ольги Примаченко, о которые можно погреть руки, как от огня в камине.\nНикаких правил. Творите из легкости, любопытства, удовольствия, радости. Доверьтесь реке вдохновения – и посмотрите, что получится.\n",
          "imagePath": "/480/152/298/101/101298152_0_Mir_kotoriy_obnimaet_Raskraska-odeyalko_Olga_Primachenko.jpg",
          "price": 12.14,
          "name": "Мир, который обнимает. Раскраска-одеялко",
          "author": "Ольга Примаченко",
          "discountPrice": 10.08
        },
        {
          "id": "0193bc89-0e48-7d61-b56d-c7e85a3f02fd",
          "description": "Всегда мечтали прогуляться по коридорам Хогвартса? Или поиграть в снежки в зимнем Хогсмиде? Тогда берите свои мантии, маркеры с карандашами и отправляйтесь в удивительное красочное приключение! На страницах этой раскраски вы заглянете в хижину Хагрида, прокатитесь на гиппогрифе, укротите \"чудовищную книгу о чудовищах\" и даже сразитесь с Василиском.\nУстраивайтесь поудобнее и погрузитесь в мир магии и творчества вместе с раскраской-антистресс по любимому фандому!\n",
          "imagePath": "/480/708/259/101/101259708_0_Raskrashivaem_mir_Rarri_Pottera_Viktoriya_Maslakova.jpg",
          "price": 8.6,
          "name": "Раскрашиваем мир Гарри Поттера",
          "author": "Виктория Маслакова",
          "discountPrice": null
        },
        {
          "id": "0193bc89-1186-7b19-8334-5d1dd9208849",
          "description": "Translator\nНа каждой странице этого пятибука вы найдете вопрос, отвечая на который каждый год в один и тот же день, вы сможете проанализировать изменения своего состояния и мыслей. Здесь собраны разные вопросы – от прозаических до тех, которые касаются смысла жизни. Ежедневник поможет расслабиться после напряженного дня, отдохнуть, привести мысли в порядок, а также повысить осознанность, научиться фиксировать мысли и эмоции.\nДля тех, кто хочет отдохнуть и снять напряжение, а также для тех, кто хочет повысить осознанность и зафиксировать изменения.\n\n",
          "imagePath": "/480/931/279/101/101279931_0_Odin_vopros_v_den_Dnevnik_na_pyat_let_relaks.jpg",
          "price": 15.17,
          "name": "Один вопрос в день. Дневник на пять лет (релакс)",
          "author": "Неизвестен",
          "discountPrice": 11.53
        },
        {
          "id": "0193bc89-13a9-7918-b52c-a00d833103c8",
          "description": "Внутри ежедневника:\nблоки для планирования и записи дел;\nтрекеры привычек;\n365 цитат из книг Ольги Примаченко;\nфразы-послания на каждый день;\nрубрики по принципу \"подсказка от Вселенной\" (\"Глагол дня\", \"Ресурс недели\", \"Особый фокус внимания\"), \"Выборы в пользу себя\", \"Метафора дня\" и др. Плюс подробные алгоритмы и инструкции, как с этими инструментами можно работать для пользы и удовольствия.\n\nОтдельные страницы в ежедневнике отведены для настройки на каждую неделю и анализа ее итогов.\nА еще вас ожидают 52 бонусные страницы с интересными практиками (в том числе с метафорическими ассоциативными картами), памятками, упражнениями, списками литературы, чек-листами, иллюстрациями для раскрашивания, колесом баланса и множеством других классных штук для исследования себя, развлечения и вдохновения!\n",
          "imagePath": "/480/389/338/101/101338389_0_I_pust_god_budet_dobrim_365_dney_bez_sueti_myatniy_Olga_Primachenko.jpg",
          "price": 20.95,
          "name": "И пусть год будет добрым. 365 дней без суеты (мятный)",
          "author": "Ольга Примаченко",
          "discountPrice": null
        },
        {
          "id": "0193bc89-165b-7eec-ad15-9ed4cddba1ac",
          "description": "Эта рабочая тетрадь – самый настоящий аккумулятор для пополнения вашего внутреннего ресурса. Она содержит систему дневных и вечерних практик, рассчитанных на 72 дня. Выполняя эти практики, вы почувствуете, что буквально переполняетесь энергией и желанием действовать! В их эффективности уже убедились 7,5 тысяч участников онлайн-марафонов Татьяны Мужицкой – присоединяйтесь и вы к этому энергетическому вихрю!\n",
          "imagePath": "/480/824/134/101/101134824_0_Ezhednevnie_praktiki_kotorie_nauchat_vas_brat_davat_i_naslazhdatsya_Tatyana_Muzhickaya.jpg",
          "price": 27.13,
          "name": "Ежедневные практики, которые научат вас брать, давать и наслаждаться",
          "author": "Татьяна Мужицкая",
          "discountPrice": 25.23
        },
        {
          "id": "0193bc89-1895-7570-84f8-498a66ee6d93",
          "description": "Джемперы или свитеры с круглой кокеткой – один из самых легендарных и любимых вязальщицами видов изделий. Разнообразные сочетания техник позволяют создавать настоящие вязаные произведения искусства.\nС этой книгой вы научитесь творить бесконечное количество собственных дизайнов, вписывая в кокетку абсолютно любой узор, делать расчеты по собственным меркам, на свою фигуру, на привычную вам плотность! Ваш свитер сядет идеально и будет совершенно уникальным – ведь вы придумали и воплотили его сами!\nКнига построена по принципу конструктора. Вы выбираете один из видов кокеток, продумываете узор, просчитываете конструкцию кокетки и вяжете ее. После следуют росток, тело и рукава, горловина и планки... Ваше уникальное изделие готово!\nОткройте для себя мир круглой кокетки без ограничений!\n",
          "imagePath": "/480/224/384/101/101384224_0_Anatomiya_krugloy_KOKETKI_Konstruktor_vyazanoy_odezhdi_na_lyubuyu_figuru_lyuboy_razmer_s_lyubim_uzorom_Anna_Kotova.jpg",
          "price": 41.99,
          "name": "Анатомия круглой КОКЕТКИ. Конструктор вязаной одежды на любую фигуру, любой размер, с любым узором",
          "author": "Анна Котова",
          "discountPrice": null
        },
        {
          "id": "0193bc89-1aa3-7bb7-b3b5-b2a0266c2d9f",
          "description": "Тук-тук... Слышите? Это Новый год стучится в двери, а с ним – и праздничное настроение. Открыв раскраску, вы окунетесь в чудесную атмосферу. Возьмите в руки цветные карандаши и оживите забавных снеговиков, зажгите огоньки гирлянды на новогодней елке, нарядите милых оленей для Дедушки Мороза, который уже спешит доставить вам подарки.\n Вперед навстречу волшебству! Полный Джингл-Беллз уже совсем рядом!\n",
          "imagePath": "/480/65/287/101/101287065_0_Polniy_Dzhingl-Bellz_Matilda_Andersen.jpg",
          "price": 8.5,
          "name": "Полный Джингл-Беллз",
          "author": "Матильда Андерсен",
          "discountPrice": 6.38
        },
        {
          "id": "0193bc89-1c82-7d6b-b84a-cb1f7e7aae6b",
          "description": "Новейшие тенденции вязальной моды! На этот раз – неброская элегантность и сдержанный шик!\nЭффектные вязаные образы с норвежским узором в стиле сканди – свяжите свой любимый свитер с круглой кокеткой, символом современной вязаной моды!\nКрасочные норвежские узоры всегда очаровывали вязальщиц. Классические или дерзкие, традиционные или провокационные – разнообразию идей практически нет предела.\nВ эту необычную книгу вошли неподвластные времени норвежские свитера с остро модной круглой кокеткой, которые вяжут классическим способом снизу вверх, сверху вниз, по кругу, поворотными рядами. Все эти способы можно использовать для создания идеального норвежского свитера в стиле сканди, характерные черты которого вы найдете в книге.\nПростота – простое объяснение с помощью доходчивых инструкций техники вязания визуально сложных узоров.\nФункциональность – красивые и одновременно практичные модели, которые можно носить каждый день.\nСтрогость линий – минималистичные и органичные фасоны, не перегруженные деталями, со сдержанными орнаментами.\nБлизость к природе – нежные белые, бежевые, пастельные тона, цвета, заимствованные у природы: травянистый, кирпичный, медовый...\nСвободолюбие – оверсайз, легкие силуэты, цветовые сочетания, которые служат особым источником вдохновения.\n\nВсе это вместе и рождает то самое неповторимое обаяние и благородную простоту стиля СКАНДИ, который покорил весь мир, прочно утвердившись в сердцах вязальщиц.\n",
          "imagePath": "/480/211/271/101/101271211_0_Vyazanie_v_stile_skandi_Norvezhskaya_kruglaya_koketka_Aktualnaya_vyazanaya_moda_Babette_Ulmer.jpg",
          "price": 31.25,
          "name": "Вязание в стиле сканди. Норвежская круглая кокетка. Актуальная вязаная мода",
          "author": "Бабетте Ульмер",
          "discountPrice": null
        },
        {
          "id": "0193bc89-1e85-7d4c-97ff-00ba09b8490b",
          "description": "Раскраска-антистресс для творчества и вдохновения.\nОт автора знаменитой \"Мифологии\" Татьяны Гущиной, которая точно знает, что рядом с нами существует целый волшебный мир, где живут феи, русалки, единороги и волшебные птицы, где деревья поют, кошки могут быть волшебницами, а рыбки исполняют желания.\n Раскрашивая эти картинки, мы погружаемся в невероятный мир, где живя наши мечты.\n",
          "imagePath": "/480/502/802/10/10802502_0_Raskraska-antistress_Zagadochnie_koshki_Tatyana_Ruschina.jpg",
          "price": 2.36,
          "name": "Раскраска-антистресс. Загадочные кошки",
          "author": "Татьяна Гущина",
          "discountPrice": 2.34
        },
        {
          "id": "0193bc89-20b6-70f7-89f2-765ae4efb3a8",
          "description": "Внутри ежедневника:\nблоки для планирования и записи дел;\nтрекеры привычек;\n365 цитат из книг Ольги Примаченко;\nфразы-послания на каждый день;\nрубрики по принципу \"подсказка от Вселенной\" (\"Глагол дня\", \"Ресурс недели\", \"Особый фокус внимания\"), \"Выборы в пользу себя\", \"Метафора дня\" и др. Плюс подробные алгоритмы и инструкции, как с этими инструментами можно работать для пользы и удовольствия.\n\nОтдельные страницы в ежедневнике отведены для настройки на каждую неделю и анализа ее итогов.\nА еще вас ожидают 52 бонусные страницы с интересными практиками (в том числе с метафорическими ассоциативными картами), памятками, упражнениями, списками литературы, чек-листами, иллюстрациями для раскрашивания, колесом баланса и множеством других классных штук для исследования себя, развлечения и вдохновения!\n",
          "imagePath": "/480/399/338/101/101338399_0_I_pust_god_budet_dobrim_365_dney_bez_sueti_siniy_Olga_Primachenko.jpg",
          "price": 20.95,
          "name": "И пусть год будет добрым. 365 дней без суеты (синий)",
          "author": "Ольга Примаченко",
          "discountPrice": 18.02
        }
      ]
    }
  },
  {
    "section": {
      "id": "0193bc89-235e-728f-b8e1-0849c6161ed0",
      "name": "Детективы",
      "books": [
        {
          "id": "0193bc89-2554-71d7-8fc4-125c39261052",
          "description": "Старая добрая Англия, 1965 год. Ярмарочная гадалка предсказывает шестнадцатилетней Фрэнсис Адамс ужасающее будущее: однажды девушку убьют... С тех пор всю свою жизнь та посвящает расследованию убийства, которое еще не произошло. Никто не принимал опасения Фрэнсис всерьез, пока, шестьдесят лет спустя, ее труп не находят в библиотеке.\nНаши дни. Энни Адамс приглашают в Грейвсдаун-холл – обширное загородное поместье ее эксцентричной двоюродной бабушки Фрэнсис. Но когда девушка прибывает в причудливую деревушку Касл-Нолл, старушка уже мертва. И по условиям завещания все ее огромное состояние, а также поместье, получит тот, кто раскроет это убийство. Расследование осложняется привычкой Фрэнсис собирать на всех компромат. Кажется, что у каждого милого и чудаковатого местного жителя имелся мотив убить ее.\nВместе с другим наследником Энни оказывается втянута в крайне опасную игру. И чем ближе разгадка, тем больше опасений, что вместо Грейвсдаун-холла она унаследует печальную судьбу своей бабушки...\n",
          "imagePath": "/480/532/367/101/101367532_0_Opasnaya_igra_babuli_Kristen_Perrin.jpg",
          "price": 20.79,
          "name": "Опасная игра бабули",
          "author": "Кристен Перрин",
          "discountPrice": null
        },
        {
          "id": "0193bc89-2777-71e8-a9ab-325ef8bb6ccb",
          "description": "Фиона, Сью и Дэйзи – три очаровательные дамы на пенсии, которые работают в небольшом благотворительном магазинчике. Однажды размеренный ритм их жизни с кофейными вторниками и прогулками по милым улочкам Саутборна нарушает жестокое убийство любимой клиентки Сары Браун.\nНе желая мириться с такой несправедливостью, они решают взять расследование в свои руки. Тем более, что появляется новое тело, а полицейские никак не могут сдвинуться с мертвой точки. Вооружившись своими познаниями в детективах и, конечно, чаем с отменными кексами три милые старушки приступают к активным действиям. Так и зарождается Детективное агентство \"Благотворительный магазин\".\n",
          "imagePath": "/480/871/341/101/101341871_0_Ubiystva_i_keksiki_Piter_Boland.jpg",
          "price": 21.54,
          "name": "Убийства и кексики",
          "author": "Питер Боланд",
          "discountPrice": null
        },
        {
          "id": "0193bc89-292c-758f-ab88-b662eaa1a2ae",
          "description": "Фиона, Сью и Дэйзи – три очаровательные дамы на пенсии, которые работают в небольшом благотворительном магазинчике. Однажды размеренный ритм их жизни с кофейными вторниками и прогулками по милым улочкам Саутборна нарушает жестокое убийство любимой клиентки Сары Браун.\nНе желая мириться с такой несправедливостью, они решают взять расследование в свои руки. Тем более, что появляется новое тело, а полицейские никак не могут сдвинуться с мертвой точки. Вооружившись своими познаниями в детективах и, конечно, чаем с отменными кексами три милые старушки приступают к активным действиям. Так и зарождается Детективное агентство \"Благотворительный магазин\".\n",
          "imagePath": "/480/911/382/101/101382911_0_Ubiystva_i_keksiki_Piter_Boland.jpg",
          "price": 16.24,
          "name": "Убийства и кексики",
          "author": "Питер Боланд",
          "discountPrice": 12.67
        },
        {
          "id": "0193bc89-2b69-7b88-81e5-90c1cf82def8",
          "description": "Роман «Десять негритят» – один из величайших детективных произведений в истории. Выпущенный общим тиражом более 100 000 000 экземпляров, он занимает пятое место в списке бестселлеров художественной литературы всех времен – и безусловное первое место среди романов самой Агаты Кристи.\nАгата Кристи – самый публикуемый автор всех времен и народов после Шекспира. Тиражи ее книг уступают только тиражам его произведений и Библии. В мире продано больше миллиарда книг Кристи на английском языке и столько же – на других языках. Она автор восьмидесяти детективных романов и сборников рассказов, двадцати пьес, двух книг воспоминаний и шести психологических романов, написанных под псевдонимом Мэри Уэстмакотт. Ее персонажи Эркюль Пуаро – и мисс Марпл навсегда стали образцовыми героями остросюжетного жанра.\nДесять никак не связанных между собой людей в особняке на уединенном острове... Кто вызвал их сюда таинственным приглашением? Зачем кто-то убивает их, одного за другим, самыми невероятными способами? Почему все происходящее так тесно переплетено с веселым детским стишком?\n",
          "imagePath": "/480/656/857/10/10857656_0_Desyat_negrityat_Agata_Kristi.jpg",
          "price": 12.62,
          "name": "Десять негритят",
          "author": "Агата Кристи",
          "discountPrice": null
        },
        {
          "id": "0193bc89-2d94-792d-a4fe-abd9dec52f81",
          "description": "\"Загадочное происшествие в Стайлзе\" – это самый первый роман Агаты Кристи. В этой книге, вышедшей в 1920 году, читатель в первый раз встречается с самым знаменитым сыщиком XX столетия – усатым бельгийцем Эркюлем Пуаро, а также с его другом и помощником Гастингсом. Именно здесь Пуаро впервые предоставлена возможность продемонстрировать свои дедуктивные способности и раскрыть загадочное преступление (отравление миссис Инглторп, хозяйки поместья Стайлз), опираясь на всем известные факты.\n",
          "imagePath": "/480/365/952/10/10952365_0_Zagadochnoe_proisshestvie_v_Staylze_Agata_Kristi.jpg",
          "price": 12.62,
          "name": "Загадочное происшествие в Стайлзе",
          "author": "Агата Кристи",
          "discountPrice": null
        },
        {
          "id": "0193bc89-2fef-7b5d-b0ff-7b0fed710788",
          "description": "Мы все безумцы или, может быть, это мир вокруг нас сошел с ума?\nДоктор Ганнибал Лектер, легендарный убийца-каннибал, попав за решетку, становится консультантом и союзником ФБР.\nНесомненно, Ганнибал Лектер – маньяк, но он и философ, и блестящий психиатр. Его мучает скука и отсутствие \"интересных\" книг в тюремной библиотеке.\nЗайдя в тупик в расследовании дела серийного убийцы, прозванного Красным Драконом, ФБР обращается к доктору Лектеру. Ведь только маньяк может понять маньяка. И Ганнибал Лектер принимает предложение. Для него важно доказать, что он умнее преступника, которого ищет ФБР.\n",
          "imagePath": "/480/273/178/101/101178273_0_Krasniy_drakon_Tomas_Harris.jpg",
          "price": 19.75,
          "name": "Красный дракон",
          "author": "Томас Харрис",
          "discountPrice": 18.76
        },
        {
          "id": "0193bc89-32a0-7421-9995-de1f9441751c",
          "description": "\"Большинство людей приезжают в Нью-Йорк, чтобы их заметили. Остальные приезжают в Нью-Йорк, чтобы спрятаться\".\nЛоуэн Эшли на грани финансового краха, поэтому она принимает предложение стать соавтором романа известной писательницы Верити Кроуфорд, которая не может закончить рукопись из-за проблем со здоровьем.\nДжереми, муж Верити, предлагает Лоуэн работать над книгой в их семейном доме. Разбирая бумажные черновики, Лоуэн находит неопубликованную автобиографию Верити. Каждая страница – леденящее душу признание. Верити пишет и про ту ночь, когда жизнь их семьи навсегда изменилась.\nС каждым днем Лоуэн и Джереми становятся ближе, но она не спешит рассказывать ему о своей находке. Все меняется, когда Лоуэн начинает сомневаться в болезни Верити, но в одном она уверена: Верити одержима.\n",
          "imagePath": "/480/49/238/101/101238049_0_Tayniy_dnevnik_Veriti_Kolin__Ruver.jpg",
          "price": 18.92,
          "name": "Тайный дневник Верити",
          "author": "Колин Гувер",
          "discountPrice": 13.62
        },
        {
          "id": "0193bc89-348d-77ea-b280-3474eb41bb9a",
          "description": "На улице так холодно, а день так короток... Идеальное время, чтобы поудобнее устроиться в теплой квартире с горячим напитком и сборником зимних уйбийственных головоломок от бесподобной Агаты Кристи! Перед вами откроется мир смертоносного снега и опасных подарков, отравленных угощений и таинственных гостей. Но господствуют в нем не злодеи, а легендарные сыщики леди Агаты во главе с Эркюлем Пуаро и мисс Марпл.\n",
          "imagePath": "/480/274/86/101/101086274_0_Ubiystvo_v_razgar_zimi_Agata_Kristi.jpg",
          "price": 18.9,
          "name": "Убийство в разгар зимы",
          "author": "Агата Кристи",
          "discountPrice": null
        },
        {
          "id": "0193bc89-3695-708a-b578-8e941ad8623e",
          "description": "В английском алфавите 26 букв. В подписи преступника, затеявшего с Эркюлем Пуаро игру при помощи писем, всего три буквы, первые, А, B и С. Он планирует совершить убийства в местах, названия которых расположены в алфавитном порядке. Задача Пуаро – разгадать замыслы убийцы и не дать ему совершить задуманные 26 преступлений.\n",
          "imagePath": "/480/360/794/10/10794360_0_Ubiystva_po_alfavitu_Agata_Kristi.jpg",
          "price": 12.62,
          "name": "Убийства по алфавиту",
          "author": "Агата Кристи",
          "discountPrice": null
        },
        {
          "id": "0193bc89-3921-7ec8-bb00-c7123c75a24e",
          "description": "Находившийся в Стамбуле великий сыщик Эркюль Пуаро возвращается в Англию на знаменитом \"Восточном экспрессе\", в котором вместе с ним едут, кажется, представители всех возможных национальностей. Один из пассажиров, неприятный американец по фамилии Рэтчетт, предлагает Пуаро стать своим телохранителем, поскольку считает, что его должны убить.\nЗнаменитый бельгиец отмахивается от этой абсурдной просьбы. А на следующий день американца находят мертвым в своем купе, причем двери закрыты, а окно открыто. Пуаро немедленно берется за расследование – и выясняет, что купе полно всевозможных улик, указывающих... практически на всех пассажиров \"Восточного экспресса\". Вдобавок поезд наглухо застревает в снежных заносах в безлюдном месте. Пуаро необходимо найти убийцу до того, как экспресс продолжит свой путь...\n",
          "imagePath": "/480/824/780/10/10780824_0_Ubiystvo_v_Vostochnom_ekspresse_Agata_Kristi.jpg",
          "price": 12.62,
          "name": "Убийство в \"Восточном экспрессе\"",
          "author": "Агата Кристи",
          "discountPrice": null
        },
        {
          "id": "0193bc89-3b49-77df-a54b-6df7331bc1f1",
          "description": "Ло Вэньчжоу – капитан отдела уголовного розыска и заведующий лотком самого капризного кота на свете.\nФэй Ду – молодой повеса, занявший президентское кресло крупной компании после того, как его отец попал в автокатастрофу.\nПервый стоит на страже правопорядка, а второй обладает удивительным талантом мыслить как преступник. Они на дух не переносят друг друга, но вынуждены сотрудничать, чтобы расследовать загадочную смерть молодого парня, приехавшего в большой город на заработки. Впрочем, это дело – далеко не единственное, что их связывает...\n",
          "imagePath": "/480/639/343/101/101343639_0_Bezmolvnoe_chtenie_Tom_1_Zhyulen_Priest.jpg",
          "price": 29.09,
          "name": "Безмолвное чтение. Том 1. Жюльен",
          "author": "Priest",
          "discountPrice": null
        },
        {
          "id": "0193bc89-3d83-73fc-bcb7-a52b463fc400",
          "description": "Фанни Функе считает себя неудачницей: школу не окончила, с родителями поссорилась и фактически сбежала из дома, поступив на годовую практику в старинный швейцарский отель «Шато Жанвье», который все называют Замком в облаках.\nПод Новый год в отеле яблоку негде упасть: сюда съехались сливки общества, в том числе семья загадочного русского олигарха, американский денежный мешок с многочисленными родственниками и специалист по драгоценным камням из Лондона, которого сопровождает обаятельный внук с замашками грабителя.\nЧто привело их сюда? Действительно ли они те, за кого себя выдают? И главное – кому из них можно доверять? Пытаясь выяснить это, Фанни оказывается в эпицентре невероятных событий...\n",
          "imagePath": "/480/969/184/101/101184969_0_Zamok_v_oblakah_Kerstin_Rir.jpg",
          "price": 21.93,
          "name": "Замок в облаках",
          "author": "Керстин Гир",
          "discountPrice": null
        },
        {
          "id": "0193bc89-3f91-7ded-8fcc-59c37a2fa1ab",
          "description": "К великому сыщику Эркюлю Пуаро обращается за помощью знаменитый физик сэр Клод Эймори, уверенный, что ему угрожает опасность. Маленький бельгиец немедленно вызывает своего давнего друга и партнера, капитана Гастингса, и они спешат в дом ученого. Однако увидеться с Эймори Пуаро не успевает – тот отравлен. При этом исчезла открытая им формула сверхмощного взрывчатого вещества. Но обстоятельства преступления сложились так, что оно было совершено в закрытом помещении, а дом еще никто из присутствовавших в нем не покидал. Значит, убийца до сих пор здесь...\n",
          "imagePath": "/480/703/73/101/101073703_0_CHerniy_kofe_Agata_Kristi.jpg",
          "price": 12.62,
          "name": "Чёрный кофе",
          "author": "Агата Кристи",
          "discountPrice": 9.59
        },
        {
          "id": "0193bc89-41d1-7894-acd5-8c03491f4ed5",
          "description": "Поначалу убийство эсквайра Роджера Экройда не казалось полиции загадочным – все указывало на виновность пасынка убитого. Но иначе считает Эркюль Пуаро, который недавно переехал в эти места, в очередной раз решив уйти на покой. Его попросила помочь племянница Экройда, которая не верит в виновность молодого человека. И Эркюль Пуаро начинает расследование, имея вокруг множество подозреваемых – родственников и знакомых эсквайра, каждый из которых был заинтересован в его смерти. Повествование ведется от имени доктора Шеппарда, последнего, кто видел Экройда живым. С помощью его записей Пуаро предстоит вычислить хитроумного преступника...\n",
          "imagePath": "/480/394/35/101/101035394_0_Ubiystvo_Rodzhera_Ekroyda_Agata_Kristi.jpg",
          "price": 12.62,
          "name": "Убийство Роджера Экройда",
          "author": "Агата Кристи",
          "discountPrice": null
        },
        {
          "id": "0193bc89-4400-7419-931b-12e4fff61d6d",
          "description": "Ю. Несбё – самый известный норвежский писатель, обладатель более двух десятков наград в номинациях \"Книга года\", \"Лучший детектив года\", \"Выбор читателей\", премии \"Стеклянный ключ\" за лучший скандинавский триллер. Его романы, переведённые более чем на 40 языков, отличает напряжённая, безукоризненно выстроенная интрига, яркие характеры и всегда неожиданная развязка.\nУже несколько лет в тот день, когда выпадает первый снег, в Норвегии бесследно исчезают замужние женщины. Невинная детская игра в снеговика оборачивается кошмаром, а для Харри Холе погоня за серийным убийцей становится охотой на тень. Преступник будто дразнит старшего инспектора, обретая всё новые и новые обличья..\n",
          "imagePath": "/480/926/207/10/10207926_0_Snegovik_Yu_Nesbe.jpg",
          "price": 12.72,
          "name": "Снеговик",
          "author": "Ю Несбе",
          "discountPrice": null
        },
        {
          "id": "0193bc89-4660-76ab-aa01-14804e8682d6",
          "description": "В летнюю ночь 1829 года старинный особняк на побережье Корнуолла замер, прислушиваясь к последнему вздоху хозяйки – леди Тревертон, – покинувшей бренный мир и оставившей безутешного мужа, маленькую дочь Розамонду и множество вопросов без ответов.\nЧто скрывала она ото всех до самой смерти и в чем сумела признаться только на смертном одре, продиктовав послание своей горничной Саре Лисон? Почему Сара не находит смелости отнести письмо своему господину, а прячет его в одной из заброшенных комнат и тут же покидает дом? И почему через шестнадцать лет она пытается помешать Розамонде вернуться в дом детства и войти в комнату?\n",
          "imagePath": "/480/852/156/101/101156852_0_Mertvaya_komnata_Uilki_Kollinz.jpg",
          "price": 10.68,
          "name": "Мёртвая комната",
          "author": "Уилки Коллинз",
          "discountPrice": null
        },
        {
          "id": "0193bc89-48ac-7516-a829-7f32841455fa",
          "description": "Япония, 1936 год. Эксцентричный художник, проживавший вместе с шестью дочерьми, падчерицами и племянницами, был найден мертвым в комнате, запертой изнутри. Его дневники, посвященные алхимии и астрологии, содержали подробный план убийства каждой из них. Лишить жизни нескольких, чтобы дать жизнь одной, но совершенной – обладательнице самых сильных качеств всех знаков Зодиака. И вскоре после этого план исполнился: части тел этих женщин находят спрятанными по всей Японии.\nК 1979 году Токийские убийства по Зодиаку будоражили нацию десятилетиями, но так и не были раскрыты. Предсказатель судьбы, астролог и великий детектив Киёси Митараи и его друг-иллюстратор должны за одну неделю разгадать тайну этого невозможного преступления. У вас есть все необходимые ключи, но сможете ли вы найти отгадку прежде, чем это сделают они?\n",
          "imagePath": "/480/826/788/10/10788826_0_Tokiyskiy_Zodiak_Sodzi_Simada.jpg",
          "price": 22.34,
          "name": "Токийский Зодиак",
          "author": "Содзи Симада",
          "discountPrice": null
        },
        {
          "id": "0193bc89-4aa6-7569-90ce-108ebc13824b",
          "description": "Артур Конан Дойл (1859-1930) – английский писатель, отдавший дань практически всем литературным жанрам, но наиболее известный как автор детективных, историко-приключенческих и фантастических произведений. И, конечно же, как создатель знаменитого тандема – Шерлока Холмса и доктора Уотсона. Книги о гениальном сыщике и его простоватом напарнике переведены практически на все языки мира, Холмс и Уотсон стали героями бесчисленных литературных подражаний, экранизаций и театральных постановок.\nПрошло уже больше ста лет с того момента, как был напечатан первый рассказ, а читатели всего мира по-прежнему с упоением погружаются в мир туманных лондонских улиц, зловещих болот и вересковых пустошей.\nВ настоящем издании представлено полное собрание рассказов и повестей о великом сыщике с Бейкер-стрит.\n",
          "imagePath": "/480/151/910/10/10910151_0_Ves_Sherlok_Holms_Ser_Artur__Konan_Doyl_Siril_Leron_Benua_Daan.jpg",
          "price": 40.23,
          "name": "Весь Шерлок Холмс",
          "author": "Бенуа Даан",
          "discountPrice": 32.99
        },
        {
          "id": "0193bc89-4dbb-7eb8-af60-7872eb50318a",
          "description": "Когда скандально известная топ-модель, упав с заснеженного балкона своего пентхауса, разбивается насмерть, все решают, что это самоубийство. Но брат девушки не может смириться с таким выводом и обращается к услугам частного сыщика по имени Корморан Страйк.\nСтрайк прошел войну, пострадал физически и душевно; жизнь его несется под откос. Теперь он рассчитывает закрыть хотя бы финансовую брешь, однако расследование оборачивается коварной ловушкой. Углубляясь в запутанную историю юной звезды, Страйк приоткрывает тайную изнанку событий – и сам движется навстречу смертельной опасности.\nЗахватывающий, отточенный сюжет разворачивается на фоне Лондона, от тихих улиц благопристойного Мэйфера до обшарпанных пабов Ист-Энда и круглосуточно бурлящего Сохо. Зов Кукушки – незаурядный и заслуженно популярный роман, в котором впервые появляется Корморан Страйк. Это также первое произведение Дж. К. Роулинг, созданное в детективном жанре и подписанное именем Роберта Гэлбрейта.\n",
          "imagePath": "/480/91/419/10/10419091_0_Zov_Kukushki_Robert_Relbreyt.jpg",
          "price": 10.92,
          "name": "Зов Кукушки",
          "author": "Роберт Гэлбрейт",
          "discountPrice": null
        },
        {
          "id": "0193bc89-4f7e-73bf-82cb-3cef51f2b4fc",
          "description": "В замке Чимниз, арендованном миллионером Освальдом Кутом, собрались на уикенд гости. Однако праздник был безнадежно испорчен: один из приглашенных внезапно умер во сне, причем при весьма странных обстоятельствах: рядом с его телом кто-то выставил сразу семь будильников. А вскоре погиб и другой гость – красивый молодой человек. Перед смертью он успел прошептать: \"Семь Циферблатов...\".\nРасследовать загадочные убийства пришлось обитателям и гостям замка. Но вскоре к ним присоединился суперинтендант Баттл...\n",
          "imagePath": "/480/637/24/101/101024637_0_Tayna_semi_ciferblatov_Agata_Kristi.jpg",
          "price": 12.39,
          "name": "Тайна семи циферблатов",
          "author": "Агата Кристи",
          "discountPrice": null
        },
        {
          "id": "0193bc89-518c-7fbb-b071-f3d3118065ba",
          "description": "Япония, Рождество 1983 года. Богатый промышленник Кодзабуро Хамамото собрал в своем особняке друзей и знакомых. Гости поражены его домом – причудливой конструкцией с множеством комнат, наклонными полами и непонятно куда ведущими лестницами, с \"падающей\" высокой башней, напоминающей Пизанскую. Все они восторгаются фантазией хозяина и готовятся весело встретить Рождество.\nНо их ожиданиям не суждено сбыться. Потому что в сочельник в доме происходит убийство. От удара ножом погибает шофер одного из приглашенных. Срочно вызванные полицейские в полном замешательстве. Ведь убийство невозможно было совершить – все обстоятельства и условия против этого. Да и мотива ни у кого нет...\nПока инспектор с помощниками ломают голову, а гости пребывают в прострации, в доме происходит второе убийство, еще более невероятное. Связавшись с начальством, ошеломленные полицейские узнают, что к ним едет человек, способный найти преступника. Что это астролог и гадатель из Токио Киёси Митараи. И что лишь он один способен разобраться в этой умопомрачительной головоломке...\nУ вас будут все необходимые ключи. Но сможете ли вы найти отгадку прежде, чем это сделают сыщики?\n",
          "imagePath": "/480/931/880/10/10880931_0_Dom_krivih_sten_Sodzi_Simada.jpg",
          "price": 22.34,
          "name": "Дом кривых стен",
          "author": "Содзи Симада",
          "discountPrice": null
        },
        {
          "id": "0193bc89-5380-794a-b901-161f77109873",
          "description": "Смерть. Точка невозврата, которая заставляет живущих ощущать растерянность и страх. Оттуда еще никто не возвращался и там, за гранью жизни, никто еще не бывал в качестве гостя. Однако с изобретением танатонавтики все меняется. Несколько смельчаков изобрели способ путешествовать по краю теней, а это повлекло за собой непредсказуемые последствия – ведь каждая конфессия желает доказать свою правоту и колонизировать загробный мир.\n",
          "imagePath": "/480/422/29/101/101029422_0_Tanatonavti_Bernar_Verber.jpg",
          "price": 23.29,
          "name": "Танатонавты",
          "author": "Бернар Вербер",
          "discountPrice": 17.93
        },
        {
          "id": "0193bc89-55a3-7202-9e6d-8c1fefc8c436",
          "description": "Декабрьским днем 1981 года в своей квартире была убита известная советская актриса Зоя Федорова. Смерть эта породила множество слухов и домыслов: от происков таинственной бриллиантовой мафии до акции западных спецслужб. Кем же на самом деле был кровавый палач – вражеским агентом или маньяком-одиночкой? Спустя несколько лет после трагедии полковник МВД Владислав Костенко выходит на след преступника. Кажется, в запутанном деле можно ставить точку... Но неожиданно правосудие оказывается бессильно что-либо сделать. И тогда Костенко решает в одиночку восстановить справедливость...\n",
          "imagePath": "/480/683/244/101/101244683_0_Tayna_Kutuzovskogo_prospekta_Yulian_Semenov.jpg",
          "price": 9.83,
          "name": "Тайна Кутузовского проспекта",
          "author": "Юлиан Семенов",
          "discountPrice": 8.06
        }
      ]
    }
  },
  {
    "section": {
      "id": "0193bc89-59b8-7b69-b4ec-964dafbca608",
      "name": "Психология",
      "books": [
        {
          "id": "0193bc89-5c42-7b9a-bc5d-847b1401d4ea",
          "description": "Использование огромных резервов, скрытых в подсознании каждого человека, позволяет решать самые сложные повседневные проблемы, когда логика оказывается бессильной.\nРазработанная автором этой книги программа поможет вам активизировать безграничные ресурсы собственного головного мозга, чтобы изменить свою жизнь к лучшему раз и навсегда.\n",
          "imagePath": "/480/200/264/10/10264200_0_Podsoznanie_mozhet_vse_Dzhon_Keho.jpg",
          "price": 23.17,
          "name": "Подсознание может всё!",
          "author": "Джон Кехо",
          "discountPrice": 16.68
        },
        {
          "id": "0193bc89-5ffc-729c-963f-9107545d8f8a",
          "description": "Наши действия и поступки определены нашими мыслями. Но всегда ли мы контролируем наше мышление? Нобелевский лауреат Даниэль Канеман объясняет, почему мы подчас совершаем нерациональные поступки и как мы принимаем неверные решения. У нас имеется две системы мышления. Медленное мышление включается, когда мы решаем задачу или выбираем товар в магазине. Обычно нам кажется, что мы уверенно контролируем эти процессы, но не будем забывать, что позади нашего сознания в фоновом режиме постоянно работает быстрое мышление – автоматическое, мгновенное и неосознаваемое...\n",
          "imagePath": "/480/348/342/10/10342348_0_Dumay_medlenno_Reshay_bistro_Deniel_Kaneman.jpg",
          "price": 40.23,
          "name": "Думай медленно... Решай быстро",
          "author": "Дэниел Канеман",
          "discountPrice": null
        },
        {
          "id": "0193bc89-6216-7260-ac53-da121b3fef2c",
          "description": "В этой книге Малкольм Гладуэлл анализирует процесс принятия решений. На богатом материале из области искусств, науки, дизайна, медицины, политики и бизнеса он раскрывает закономерности бессознательных решений и анализирует факторы, искажающие этот процесс.\nАвтор утверждает, что все решения мы принимаем с первого взгляда – за две секунды. \"Сила мгновенных решений\" – книга именно об этих первых двух секундах.\n",
          "imagePath": "/480/923/690/10/10690923_0_Sila_mgnovennih_resheniy_Intuiciya_kak_navik_Malkolm_Rladuell.jpg",
          "price": 9.82,
          "name": "Сила мгновенных решений. Интуиция как навык",
          "author": "Малкольм Гладуэлл",
          "discountPrice": null
        },
        {
          "id": "0193bc89-6485-709a-8f4c-3a0754979198",
          "description": "Книга вовсе не о борьбе добра со злом. Добра здесь, к сожалению, намного меньше. Зимбардо возвращается к своему знаменитому Стэнфордскому тюремному эксперименту, откуда берут начало его исследования природы человеческого зла. Правда, в конце книги его программа о сопротивлении нежелательным влияниям звучит обнадеживающе и вполне уверенно.\n",
          "imagePath": "/480/564/295/10/10295564_0_Effekt_Lyucifera_Pochemu_horoshie_lyudi_prevraschayutsya_v_zlodeev_Filip_Zimbardo.jpg",
          "price": 37.54,
          "name": "Эффект Люцифера. Почему хорошие люди превращаются в злодеев",
          "author": "Филип Зимбардо",
          "discountPrice": 36.41
        },
        {
          "id": "0193bc89-669c-7301-ab7b-45ab6496a5b4",
          "description": "У вас в руках уникальная книга-тренажер, которая поможет вам эффективнее думать, лучше понимать себя и других, а также принимать взвешенные решения. Вас ждет увлекательное путешествие по лабиринтам нашего мозга, масса удивительных открытий и целый арсенал работающих приемов и методик.\nКнига состоит из двух частей, и начинать читать вы можете с любой. С части \"Мне бы уметь и знать\" стоит начать, если нужно усовершенствовать мышление. Отточить навык ясно мыслить поможет большой набор правил, рекомендаций и алгоритмов. Часть «Вот бы решить проблему» позволит вам справиться со множеством когнитивных трудностей, с которыми сталкивается любой из нас.\nВ конце каждой из частей есть подборка любопытных задач и упражнений, которые помогут закрепить все изученное на практике.\nГлавное правило – не торопиться. Авторы рекомендуют неспешно и вдумчиво прочитывать по одной главе в день и обязательно выполнять все упражнения – только так получится превратить знания в практические навыки. Теперь у вас есть личный тренер мышления. С этой книгой действительно надо думать!\nДля кого:\nДля тех, кто хочет прокачать навыки мышления, память и сообразительность, научиться мыслить логически, системно и аналитически. Для тех, кто хочет обучиться критическому и креативному мышлению\n",
          "imagePath": "/480/636/380/101/101380636_0_Nado_dumat_Trenazher_mishleniya_Nikita_Nepryahin_Dmitriy_Skvorcov.jpg",
          "price": 25.04,
          "name": "Надо думать! Тренажер мышления",
          "author": "Никита Непряхин",
          "discountPrice": null
        },
        {
          "id": "0193bc89-6894-79f7-a8c7-befefb87a0ad",
          "description": "Новая, продвинутая версия легендарного бестселлера! Перед вами книга с лучшей в мире методикой тренировки мозга. Упражнения, которые вы будете выполнять всего по 5 минут каждый день, помогут активно развивать психические процессы: память, мышление, внимание.\nЭто кажется невозможным? Попробуйте! Уже более двух миллионов людей в мире достигли невероятных результатов, пользуясь этой методикой. Теперь она поможет и вам!\n",
          "imagePath": "/480/606/494/10/10494606_0_Treniruy_svoy_mozg_Yaponskaya_sistema_razvitiya_intellekta_i_pamyati_Prodvinutaya_versiya_Ryuta_Kavashima.jpg",
          "price": 17.73,
          "name": "Тренируй свой мозг. Японская система развития интеллекта и памяти. Продвинутая версия",
          "author": "Рюта Кавашима",
          "discountPrice": 13.3
        },
        {
          "id": "0193bc89-6a8b-74d7-9077-86f80267382d",
          "description": "Мозг знает о нас всё и управляет нами. А еще он очень чутко реагирует на музыку – так, что ищет мелодии и ритмы даже в повседневном шуме. Многие из нас считают, что мелодия и гармония – лучшие лекарства от хандры, а прослушивание классических музыкальных произведений может сделать нас умнее и излечить серьезные недуги. Правда ли это? Неужели музыка действительно обладает такой силой воздействия на организм человека?\nНорвежские преподаватели нейробиологии музыки Аре Бреан и Гейр Ульве Скейе помогают заглянуть внутрь собственной головы и посмотреть, что там происходит, когда вы слушаете любимую песню.\nЗачем читать:\nузнать, как сильно музыка воздействует на наш мозг, организм, настроение и жизнь в целом;\nизучить особенности анатомии мозга, узнать как музыка влияет на самочувствие, в том числе как работает музыкальная терапия при серьезных заболеваниях;\nнаучиться слушать музыку целенаправленно.\n\n",
          "imagePath": "/480/899/211/101/101211899_0_Muzika_i_mozg_Kak_muzika_vliyaet_na_emocii_zdorove_i_intellekt_Skeye_Reyr_Ulve_Are_Brean.jpg",
          "price": 9.82,
          "name": "Музыка и мозг. Как музыка влияет на эмоции, здоровье и интеллект",
          "author": "Аре Бреан",
          "discountPrice": null
        },
        {
          "id": "0193bc89-6c8a-74a7-9328-de7e15da5330",
          "description": "Книга молодого научного журналиста Аси Казанцевой – об \"основных биологических ловушках, которые мешают нам жить счастливо и вести себя хорошо\". Опираясь по большей части на авторитетные научные труды и лишь иногда – на личный опыт, автор увлекательно и доступно рассказывает, откуда берутся вредные привычки, почему в ноябре так трудно работать и какие вещества лежат в основе \"химии любви\".\n",
          "imagePath": "/480/74/356/10/10356074_0_Kto_bi_mog_podumat_Kak_mozg_zastavlyaet_nas_delat_gluposti_Asya_Kazanceva.jpg",
          "price": 27.98,
          "name": "Кто бы мог подумать! Как мозг заставляет нас делать глупости",
          "author": "Ася Казанцева",
          "discountPrice": 27.14
        }
      ]
    }
  }
]
